## 데이터 프레임 복습

In [1]:
# 데이터 프레임 생성 
import pandas as pd

In [2]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})
type(df)

pandas.core.frame.DataFrame

In [3]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [14]:
a = [[1, 4, 7], [2, 5, 8], [3, 6, 9]]
a

[[1, 4, 7], [2, 5, 8], [3, 6, 9]]

In [15]:
df2 = pd.DataFrame(a)
df2

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [9]:
df2.columns = ['a', 'b', 'c']
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [10]:
df3 = pd.DataFrame({'company' : ['abc', '회사', '123'], '직원수' : [400, 10, 6]})
df3

  company  직원수
0     abc  400
1      회사   10
2     123    6

In [11]:
import numpy as np
df3['위치'] = ['Seoul', np.nan, 'Busan']
df3

  company  직원수     위치
0     abc  400  Seoul
1      회사   10    NaN
2     123    6  Busan

In [17]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9